uhnp/src/InformationRegisters/РегистрацииЗапросовСтатусовВыплатыПособий/РегистрацииЗапросовСтатусовВыплатыПособий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>РегистрацииЗапросовСтатусовВыплатыПособий</name>
  <comment>Типы СЭДО 85, 8510.</comment>
  <resources>
    <name>ГоловнаяОрганизация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </resources>
  <resources>
    <name>Страхователь</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </resources>
  <resources>
    <name>ИсходящийДокумент</name>
    <type>
      <types>DocumentRef.ЗапросСтатусовВыплатыПособия</types>
    </type>
  </resources>
  <resources>
    <name>Состояние</name>
    <type>
      <types>EnumRef.СостоянияДокументаСЭДОФСС</types>
    </type>
  </resources>
  <resources>
    <name>ДоставкаУспех</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ДоставкаДата</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ДоставкаИдентификаторПакета</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ОтправленОператору</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ДатаОтправкиОператору</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ЕстьОшибкиФЛК</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>РегистрацияУспех</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>РегистрацияДата</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>РегистрацияИдентификатор</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>РегистрацияСсылка</name>
    <type>
      <types>DocumentRef.СтатусыВыплатыПособия</types>
    </type>
  </resources>
  <attributes>
    <name>ДоставкаТекстОшибки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>РегистрацияТекстОшибки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстОшибкиФЛК</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <dimensions>
    <name>ИдентификаторСообщения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

uhnp/src/Documents/СтатусыВыплатыПособия/СтатусыВыплатыПособия.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>СтатусыВыплатыПособия</name>
  <comment>Тип СЭДО 85.</comment>
  <attributes>
    <name>ИдентификаторСообщения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСообщения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Страхователь</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ГоловнаяОрганизация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Загружен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстОшибки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ФизическоеЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсходящийДокумент</name>
    <type>
      <types>DocumentRef.ЗапросСтатусовВыплатыПособия</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторСтрокиРеестра</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторРеестра</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СведенияОВыплатах</name>
    <attributes>
      <name>ИдентификаторСтрокиРеестра</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторРеестра</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерПроцесса</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>19</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СотрудникСНИЛС</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>14</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ФизическоеЛицо</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерЛН</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>12</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Дата</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтатусВыплаты</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Удержано</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>13</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ФиксацияИзменений</name>
    <attributes>
      <name>ИмяРеквизита</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Путь</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторСтроки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>НеобработанныеУзлы</name>
    <attributes>
      <name>Имя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Путь</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>256</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПредставлениеСодержимого</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

uhnp/src/InformationRegisters/РегистрацииЗапросовСтатусовВыплатыПособий/Forms/ФормаЗаписи/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не ЗначениеЗаполнено(Запись.ИсходящийДокумент) Тогда
		ОбновитьЭлементыФормы();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	Если ЗначениеЗаполнено(Запись.ИсходящийДокумент) Тогда
		ТолькоПросмотр = Истина;
	Иначе
		Элементы.ИсходныйДокументГруппа.Поведение = ПоведениеОбычнойГруппы.Обычное;
	КонецЕсли;
	
	// СтандартныеПодсистемы.ДатыЗапретаИзменения
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.ДатыЗапретаИзменения
	
	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	ОбновитьЭлементыФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "Запись_ОтветНаЗапросФССДляРасчетаПособия"
		И (Источник = Запись.ИсходящийДокумент Или Не ЗначениеЗаполнено(Источник)) Тогда
		ПодключитьОбработчикОжиданияПрочитать();
		
	ИначеЕсли ИмяСобытия = СЭДОФССКлиент.ИмяСобытияПослеПолученияСообщенийОтФСС()
		Или ИмяСобытия = СЭДОФССКлиент.ИмяСобытияПослеОтправкиПодтвержденияПолучения() Тогда
		ПодключитьОбработчикОжиданияПрочитать();
		
	ИначеЕсли ИмяСобытия = "Запись_РегистрацииОтветовНаЗапросыФССДляРасчетаПособий"
		И (Источник = Запись.ИсходящийДокумент Или Не ЗначениеЗаполнено(Источник)) Тогда
		ПодключитьОбработчикОжиданияПрочитать();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущаяЗапись, ПараметрыЗаписи)
	Менеджер = РегистрыСведений.РегистрацииЗапросовСтатусовВыплатыПособий;
	Менеджер.ЗаполнитьСостояниеРегистрации(ТекущаяЗапись);
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	Оповестить("Запись_РегистрацииОтветовНаЗапросыФССДляРасчетаПособий", Запись.ИсходящийДокумент, Запись.ИсходящийДокумент);
	СЭДОФССКлиент.ОповеститьОНеобходимостиОбновитьТекущиеДела();
	
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПоясняющаяНадписьВШапкеОбработкаНавигационнойСсылки(Элемент, Адрес, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Если Адрес = "1" Тогда
		ПараметрыФормы = Новый Структура("Ключ", Запись.ИсходящийДокумент);
		ОткрытьФорму("Документ.ЗапросСтатусовВыплатыПособия.ФормаОбъекта", ПараметрыФормы);
	ИначеЕсли Адрес = "2" Тогда
		ПараметрыФормы = Новый Структура("Ключ", Запись.РегистрацияСсылка);
		ОткрытьФорму("Документ.СтатусыВыплатыПособия.ФормаОбъекта", ПараметрыФормы);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ДоставкаИдентификаторТекстXML(Команда)
	СЭДОФССКлиент.ПоказатьТекстXML(Запись.ИдентификаторСообщения);
КонецПроцедуры

&НаКлиенте
Процедура РегистрацияИдентификаторТекстXML(Команда)
	СЭДОФССКлиент.ПоказатьТекстXML(Запись.РегистрацияИдентификатор);
КонецПроцедуры

&НаКлиенте
Процедура ВключитьВозможностьРедактирования(Команда)
	ТолькоПросмотр = Ложь;
	ОбновитьЭлементыФормы();
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ПодключитьОбработчикОжиданияПрочитать()
	ОтключитьОбработчикОжидания("ОбработчикОжиданияПрочитать");
	ПодключитьОбработчикОжидания("ОбработчикОжиданияПрочитать", 0.2, Истина);
КонецПроцедуры

&НаКлиенте
Процедура ОбработчикОжиданияПрочитать()
	Если Не Модифицированность Тогда
		Прочитать();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ОбновитьЭлементыФормы()
	Элементы.ДоставкаИдентификаторТекстXML.Видимость    = ЗначениеЗаполнено(Запись.ИдентификаторСообщения);
	Элементы.РегистрацияИдентификаторТекстXML.Видимость = ЗначениеЗаполнено(Запись.РегистрацияИдентификатор);
	
	ОтправленОператору = (Запись.ОтправленОператору Или ЗначениеЗаполнено(Запись.ДатаОтправкиОператору));
	Элементы.ОтправленОператору.Видимость          = Не ТолькоПросмотр Или ОтправленОператору;
	Элементы.ДатаОтправкиОператору.Видимость       = Не ТолькоПросмотр Или ОтправленОператору;
	Элементы.ДоставкаИдентификаторПакета.Видимость = Не ТолькоПросмотр Или ОтправленОператору
		Или ЗначениеЗаполнено(Запись.ДоставкаИдентификаторПакета);
	
	Элементы.ОшибкиЛогическогоКонтроляГруппа.Видимость = Не ТолькоПросмотр
		Или Запись.ЕстьОшибкиФЛК;
	
	Если РежимОткрытияОкна = РежимОткрытияОкнаФормы.БлокироватьОкноВладельца Тогда
		Элементы.КоманднаяПанельПодвал.Видимость = Истина;
		Элементы.КомандыЗаписиИПроведения.Видимость = Ложь;
		КнопкаЗакрыть = Элементы.КнопкаЗакрытьВПодвале;
	Иначе
		Элементы.КоманднаяПанельПодвал.Видимость = Ложь;
		Элементы.КомандыЗаписиИПроведения.Видимость = Истина;
		КнопкаЗакрыть = Элементы.КнопкаЗакрытьВШапке;
	КонецЕсли;
	
	Если Запись.ДоставкаУспех
		И Не ЗначениеЗаполнено(Запись.РегистрацияИдентификатор)
		И Не Запись.ЕстьОшибкиФЛК Тогда
		Элементы.ПолучитьНовыеСообщенияСЭДОФСС.КнопкаПоУмолчанию = Истина;
	Иначе
		КнопкаЗакрыть.КнопкаПоУмолчанию = Истина;
	КонецЕсли;
	
	ЕстьРегистрация = ЗначениеЗаполнено(Запись.РегистрацияСсылка);
	Элементы.НадписьВШапкеЕстьСсылкаРегистрации.Видимость = ТолькоПросмотр И ЕстьРегистрация;
	Элементы.НадписьВШапкеНетСсылкиРегистрации.Видимость = ТолькоПросмотр И Не ЕстьРегистрация;
	
	Если ТолькоПросмотр И (Запись.ЕстьОшибкиФЛК Или ЗначениеЗаполнено(Запись.РегистрацияИдентификатор)) Тогда
		Положение = ПоложениеКнопкиВКоманднойПанели.ВДополнительномПодменю;
	Иначе
		Положение = ПоложениеКнопкиВКоманднойПанели.ВКоманднойПанелиИВДополнительномПодменю;
	КонецЕсли;
	Элементы.ПолучитьНовыеСообщенияСЭДОФСС.ПоложениеВКоманднойПанели = Положение;
	
	Элементы.ДоставкаТекстОшибки.Видимость = Не ТолькоПросмотр
		Или ЗначениеЗаполнено(Запись.ДоставкаТекстОшибки);
	Элементы.ТекстОшибкиФЛК.Видимость = Не ТолькоПросмотр
		Или ЗначениеЗаполнено(Запись.ТекстОшибкиФЛК);
	Элементы.РегистрацияТекстОшибки.Видимость = Не ТолькоПросмотр
		Или ЗначениеЗаполнено(Запись.РегистрацияТекстОшибки);
	
	КлючСохраненияПоложенияОкна = ?(ТолькоПросмотр,
		Формат(ОтправленОператору, "БЛ=0; БИ=1") + Формат(Запись.ЕстьОшибкиФЛК, "БЛ=0; БИ=1"),
		"");
	
КонецПроцедуры

#КонецОбласти
